event_1.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <o:UsernameToken u:Id="uuid-695825e5-6b37-4084-b0b7-2e98d4207d73-151">
                <o:Username>james1907</o:Username>
                <o:Password o:Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Password1</o:Password>
            </o:UsernameToken>
        </o:Security>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <PutPendingEvent xmlns="http://services.mycccportal.com/SOA/EventService">
            <NormalizedMessage xmlns="http://services.mycccportal.com/SOA/normalizedmessage/v1">
                <BaseDescriptor>
                    <MsgID>8f4059f3-caf8-4b05-bf01-40d4ef46282d</MsgID>
                    <MsgType>Events</MsgType>
                    <MsgMode>Request</MsgMode>
                    <SourceTimeStamp>2017-02-07T16:05:06.151931-06:00</SourceTimeStamp>
                    <SourceApplicationID>PTHWY</SourceApplicationID>
                    <SourceUserID>NA</SourceUserID>
                </BaseDescriptor>
                <RoutingDescriptor>
                    <RoutingInfo xmlns="http://services.mycccportal.com/SOA/commontypes">
                        <ApplicationName>PTHWY</ApplicationName>
                        <ApplicationVersion>4.50</ApplicationVersion>
                        <PublishTimeStamp>2017-02-07T16:05:06.151931-06:00</PublishTimeStamp>
                    </RoutingInfo>
                </RoutingDescriptor>
                <ClaimDescriptor>
                    <ClaimReferenceID>eqa02072017154227</ClaimReferenceID>
                    <ClaimTypeCode>VE</ClaimTypeCode>
                    <InsuranceCompany>
                        <VantiveCode>APM1</VantiveCode>
                    </InsuranceCompany>
                    <ClaimOffice>
                        <Code>APMC</Code>
                    </ClaimOffice>
                    <AssigneeDescriptor>
                        <Appraiser>
                            <AppraiserType>DRP</AppraiserType>
                            <AppraiserSSN>302919</AppraiserSSN>
                            <AppraiserMailboxID/>
                        </Appraiser>
                    </AssigneeDescriptor>
                </ClaimDescriptor>
                <Payload>
                    <Data><?xml version="1.0"?>
<Events xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://tempuri.org/XMLSchema.xsd">
  <TrackingId>0ee3e306-667b-44a1-9248-e35be8e64c9d</TrackingId>
  <CompanyCode>APM1</CompanyCode>
  <RoutingCompanyCode>4436</RoutingCompanyCode>
  <OfficeCode>APMC</OfficeCode>
  <ClaimRefID>eqa02072017154227</ClaimRefID>
  <EventSequenceNumber>1</EventSequenceNumber>
  <OfficeMailboxID />
  <IAFileID />
  <ClaimType>1</ClaimType>
  <UserName>james1907</UserName>
  <Action>2</Action>
  <FolderCreatedTime>2017-02-07T00:00:00</FolderCreatedTime>
  <EventCreatedTime>2017-02-07T00:00:00</EventCreatedTime>
  <EventManualTime>2017-02-07T00:00:00-06:00</EventManualTime>
  <EventCode>DTAS</EventCode>
  <EventDescription>Date assigned.</EventDescription>
  <EventType>2</EventType>
  <CommunicationType />
  <FromSource>0</FromSource>
  <ToSource>0</ToSource>
  <FileName />
  <FileExtension />
  <SoftwareSerialNumber>302919</SoftwareSerialNumber>
  <Identifier />
  <ContextInfo>
    <InsuranceCompanyName>AUTOMATED PROCESS MANAGEMENT ONE</InsuranceCompanyName>
    <ClaimNumber>eqa02072017154227</ClaimNumber>
    <OwnerFirstName>firstName</OwnerFirstName>
    <OwnerLastName>lastName</OwnerLastName>
    <VehicleYear>2016</VehicleYear>
    <VehicleMake>BMW</VehicleMake>
    <VehicleModel>2 Series 228i RWD</VehicleModel>
  </ContextInfo>
</Events></Data>
                    <Reference>http://services.mycccportal.com/Events/0ee3e306-667b-44a1-9248-e35be8e64c9d/2b78df0c-5f66-4fa4-9990-5bc8584b1aaa</Reference>
                </Payload>
            </NormalizedMessage>
        </PutPendingEvent>
    </s:Body>
</s:Envelope>
